In [3]:
import seaborn as sns

# Load Titanic dataset from seaborn
df = sns.load_dataset('titanic')

# print head
df.head()
# test = df['class']
# print(test)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
# Drop not needed columns
df = df.drop(columns=['pclass', 'embark_town', 'deck', 'adult_male', 'alone','fare','embarked','who', 'alive'], errors='ignore')
# Drop rows where 'age' is missing
df = df.dropna(subset=['age'])

df.head()

   survived     sex   age  sibsp  parch  class
0         0    male  22.0      1      0  Third
1         1  female  38.0      1      0  First
2         1  female  26.0      0      0  Third
3         1  female  35.0      1      0  First
4         0    male  35.0      0      0  Third

In [ ]:
# feature: sex, age, class, family_size
# target = alive

In [6]:
d = {'First': 1, 'Second': 2, 'Third': 3} # assign numerical values to class
df['class'] = df['class'].map(d)
df.head()

   survived     sex   age  sibsp  parch class
0         0    male  22.0      1      0     3
1         1  female  38.0      1      0     1
2         1  female  26.0      0      0     3
3         1  female  35.0      1      0     1
4         0    male  35.0      0      0     3